**Step-1: Import Packages**

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create dataframe using list**

In [5]:
names = ['Ramesh','suresh','sathish']
# pd.DataFrame(data,index,colummn)
pd.DataFrame(names)

         0
0   Ramesh
1   suresh
2  sathish

**Step-3: Add columns**

In [7]:
names = ['Ramesh','suresh','sathish']
# pd.DataFrame(data,index,colummn)
pd.DataFrame(names,columns=['Names'])

     Names
0   Ramesh
1   suresh
2  sathish

In [21]:
names = ['Ramesh','suresh','sathish']
agee = [20,30,52]
#pd.DataFrame(data,index,colummn)
#pd.DataFrame(names,columns=['Names'])
#pd.DataFrame(agee,1,columns=['Age'])

**Step-4: Update the index**

In [31]:
names = ['Ramesh','suresh','sathish']
# pd.DataFrame(data,index,colummn)
pd.DataFrame(names,index = ['A','B','C'],columns=['Names'])

     Names
A   Ramesh
B   suresh
C  sathish

In [37]:
names = ['Ramesh','suresh','sathish']
cols = ['Names']
idx = ['A','B','C']
pd.DataFrame(names,idx,cols)

     Names
A   Ramesh
B   suresh
C  sathish

**Step-5: Create a Dataframe with multiple columns**

In [46]:
names = ['Ramesh','suresh','sathish']
city = ['Chandrapur','Hyderabad','Chennai']
cols = ['Names','City']
idx = ['A','B','C']
data = [names,city]
pd.DataFrame(data)

            0          1        2
0      Ramesh     suresh  sathish
1  Chandrapur  Hyderabad  Chennai

In [31]:
names = ['Ramesh','suresh','sathish']
city = ['Chandrapur','Hyderabad','Chennai']
cols = ['Names','City']
idx = ['A','B','C']
data = [names,city]
pd.DataFrame(data,index=cols,columns=idx)

                A          B        C
Names      Ramesh     suresh  sathish
City   Chandrapur  Hyderabad  Chennai

In [54]:
names = ['Ramesh','suresh','sathish']
city = ['Chandrapur','Hyderabad','Chennai']
cols = ['Names','City']
idx = ['A','B','C']
data = [names,city]
pd.DataFrame(data,index=cols,columns=idx).T       # .T with Transpose the values

     Names        City
A   Ramesh  Chandrapur
B   suresh   Hyderabad
C  sathish     Chennai

In [60]:
names = ['Ramesh','suresh','sathish']
city = ['Chandrapur','Hyderabad','Chennai']
cols = ['Names','City']
idx = ['A','B','C']
data = zip(names,city)
pd.DataFrame(data,index=idx,columns=cols)

     Names        City
A   Ramesh  Chandrapur
B   suresh   Hyderabad
C  sathish     Chennai

In [41]:
names = ['Ramesh','suresh','sathish']
city = ['Chandrapur','Hyderabad','Chennai']
age = [ 20,23,25]
cols = ['Names','City','Age']
idx = ['A','B','C']
data = zip(names,city,age)
pd.DataFrame(data,index=idx,columns=cols)

     Names        City  Age
A   Ramesh  Chandrapur   20
B   suresh   Hyderabad   23
C  sathish     Chennai   25

**Step-6: How to add data to empty dataframe**

In [65]:
l = []
l.append(20)
l

[20]

In [43]:
df = pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','SAtish']
df['Age'] = [10,29,23]
df['City'] = ['Hyd','Mumbai','Mh']
df

    Names  Age    City
0  Ramesh   10     Hyd
1  Suresh   29  Mumbai
2  SAtish   23      Mh

**Step-7: Crate a dataframe using dictionary**

In [5]:
d = {'Names':['Ram','ranu','anji'],
    'Age':[20,32,12],
     'City': ['Pune','mum','ch']}
df = pd.DataFrame(d)
df

  Names  Age  City
0   Ram   20  Pune
1  ranu   32   mum
2  anji   12    ch

**Step-8: Methods**

- Shape

- Size

- columns

- datatypes

- isnull

In [8]:
df.shape

(3, 3)

In [93]:
df.size

9

In [95]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [99]:
df.dtypes

Names    object
Age       int64
City     object
dtype: object

In [101]:
df.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False

In [103]:
# columns wise null values available

df.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

In [105]:
df = pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','SAtish']
df['Age'] = [10,29,23]
df['City'] = ['Hyd','Mumbai','Mh']
df

    Names  Age    City
0  Ramesh   10     Hyd
1  Suresh   29  Mumbai
2  SAtish   23      Mh

## **Step-9: Rename**

In [107]:
# if we want to rename  all the columns

df.columns = ['A','B','C']
df

        A   B       C
0  Ramesh  10     Hyd
1  Suresh  29  Mumbai
2  SAtish  23      Mh

In [111]:
# if we want to rename  all the index

df.index = [1,2,3]
df

        A   B       C
1  Ramesh  10     Hyd
2  Suresh  29  Mumbai
3  SAtish  23      Mh

**Anathor way of rename**

df.rename(mapper,index,columns,axis,inplace)

In [116]:
df = pd.DataFrame()
df['Names'] = ['Ramesh','Suresh','SAtish']
df['Age'] = [10,29,23]
df['City'] = ['Hyd','Mumbai','Mh']
df

    Names  Age    City
0  Ramesh   10     Hyd
1  Suresh   29  Mumbai
2  SAtish   23      Mh

In [49]:
d = {'Names': 'A','Age':'B','City':'C'}
df.rename(columns=d,inplace=True)
df

        A   B       C
0  Ramesh  10     Hyd
1  Suresh  29  Mumbai
2  SAtish  23      Mh

In [ ]:
#  I want to chage my columns 
# i provided dictionalry of a mapper with new columns 




# i want to feed to food you
# i prepared a food

In [14]:
import pandas as pd
d = {'Names': 'Terrorist', 'City': 'Shahar'}               # we can modify each name with their old name
df.rename(columns=d,inplace=True)
df

  Terrorist  Age Shahar
0       Ram   20   Pune
1      ranu   32    mum
2      anji   12     ch

In [16]:
d = {'Names': 'A','Age':'B','City':'C'}
df.rename(index=d,inplace=True)
df

  Terrorist  Age Shahar
0       Ram   20   Pune
1      ranu   32    mum
2      anji   12     ch

In [55]:
df = pd.DataFrame()
df['Names'] = ['Ramesh','priya','SAtish']
df['Age'] = [10,29,23]
df['City'] = ['Hyd','Mumbai','Mh']
df.rename(d,inplace=True)
#df.rename(
df

    Names  Age    City
0  Ramesh   10     Hyd
1   priya   29  Mumbai
2  SAtish   23      Mh

## **May 23**

**Step-10: Import data into esisting dataframe**

In [32]:
d = { 'Names': ['Sandip','Sanju','Pratik'],
     'Age': [20,23,21],
     'City': ['Chandrapur','Gadchiroli','Nagpur']
    }
df = pd.DataFrame(d)
df['Marks'] = [90,34,56]
df

    Names  Age        City  Marks
0  Sandip   20  Chandrapur     90
1   Sanju   23  Gadchiroli     34
2  Pratik   21      Nagpur     56

In [48]:
d = { 'Names': ['Sandip','Sanju','Pratik'],
     'Age': [20,23,21],
     'Marks': [90,98,89]
    }
df = pd.DataFrame(d)
df['City'] = ['Chandrapur','Gadchiroli','Nagpur']            # adding new column directly to the dataframe
df['Age'] = [50,34,54]                                       # Modifing the existing data values
df.index=[1,2,3]                                             # adding index
df

    Names  Age  Marks        City
1  Sandip   50     90  Chandrapur
2   Sanju   34     98  Gadchiroli
3  Pratik   54     89      Nagpur

**Step-11: Save the DataFrame**

- if we want to read or write we need 3 values

  - where you want to save
 
  - on which name you want to save
 
  - on which format you want to save
 
- filename.txt

- filename.csv  or filename.xlsx

- Note: if i provide file name it will save in current directory

In [68]:
df.to_csv('data.csv',index=False)     # it saves in current directory

In [61]:
# this will save in which location i want

df.to_csv(r'C:\Users\HP\Documents\Naresh it\Data analysis\Operations\data.csv')

**Step-12: Read the dataFrame**

In [70]:
pd.read_csv('data.csv')

    Names  Age  Marks        City
0  Sandip   50     90  Chandrapur
1   Sanju   34     98  Gadchiroli
2  Pratik   54     89      Nagpur

In [80]:
df.to_excel('data.xlsx',index=False)

In [82]:
pd.read_excel('data.xlsx')

    Names  Age  Marks        City
0  Sandip   50     90  Chandrapur
1   Sanju   34     98  Gadchiroli
2  Pratik   54     89      Nagpur

In [ ]:
Now the Second part on session 2